       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULADORA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 NUM1	PIC S9(05)V99 VALUE 0.
       77 NUM2	PIC S9(05)V99 VALUE 0.
       77 RESULTADO PIC 9(05)V99 VALUE 0.
       77 OPERACION PIC A(01).

       PROCEDURE DIVISION.
	   ACCEPT NUM1 FROM ARGUMENT-VALUE
	   ACCEPT NUM2 FROM ARGUMENT-VALUE
           ACCEPT OPERACION FROM ARGUMENT-VALUE
	   IF OPERACION = "a" THEN
               ADD NUM1 TO NUM2 GIVING RESULTADO.
	   IF OPERACION = "m" THEN
               SUBTRACT NUM1 FROM NUM2 GIVING RESULTADO.
	   IF OPERACION = "M" THEN
               MULTIPLY NUM1 BY NUM2 GIVING RESULTADO.
	   IF OPERACION = "d" THEN
               DIVIDE NUM1 INTO NUM2 GIVING RESULTADO.
           DISPLAY RESULTADO.           
       STOP RUN.
